{
  "editor": {
    "settings": {
      "title": "Impostazioni",
      "language": "Seleziona lingua",
      "countrySections": "Sezioni Specifiche per Paese",
      "countryOptions": {
        "all": "Tutte",
        "none": "Nessuno",
        "italy": "Italia"
      }
    },
    "upload": {
      "title": "Carica un file publiccode.yml esistente",
      "file": "File",
      "url": "URL",
      "remote": "Remote",
      "upload": "Carica"
    },
    "owner": "Dipartimento per la Trasformazione Digitale",
    "additional_owner": "AgID",
    "back": "Indietro",
    "cancel": "Annulla",
    "title": "publiccode.yml Editor",
    "needhelp": "Aiuto?",
    "source_code": "Codice sorgente",
    "lastgeneration": "Ultimo aggiornamento",
    "addlanguage": "aggiungi lingua al file publiccode.yml...",
    "nocodegenerated": "Nessun publiccode generato",
    "copy": "Copia",
    "copytext": "Copiato negli appunti",
    "download": "Scarica",
    "import": "Importa",
    "genericerror": "Ci sono degli errori",
    "success": "Ottimo",
    "browsefile": "Carica il file dal disco",
    "browse": "Sfoglia",
    "pastefile": "Incolla l'URL del tuo publiccode.yml",
    "importSource": "Seleziona tipologia",
    "selectSource": "Seleziona Sorgente",
    "source": "Sorgente",
    "gitlab": "GitLab",
    "other": "Altro",
    "load": "Carica",
    "notvalidurl": "URL non valido",
    "filenotsupported": "File non supportato",
    "warnings": "Warnings",
    "errors": {
      "yamlloading": "Errore nel caricamento dello yaml"
    },
    "form": {
      "add": "Aggiungi",
      "deprecatedField": "deprecated",
      "noContacts": "Nessun contatto presente",
      "noContractors": "Nessun riferimento presente",
      "reset": {
        "button": "Reimposta",
        "notification_title": "Dati cancellati",
        "notification_text": "Tutti i dati inseriti sono stati cancellati"
      },
      "upload": "Carica",
      "validate": {
        "success": {
          "title": "Validazione avvenuta con successo",
          "text": "Il file publiccode.yml generato è valido"
        },
        "error": {
          "title": "Errori di validazione",
          "text": "Controlla i campi della form"
        },
        "info": {
          "title": "Campi sconosciuti rimossi"
        },
        "button": "Valida"
      },
      "generate": "Genera",
      "addnew": "Aggiungi",
      "overwrite": "Sovrascrivi",
      "overwritetext": "Questa operazione cancellerà tutti i dati già inseriti",
      "unset": "(Non impostato)",
      "true": "Sì",
      "false": "No",
      "noFunders": "Nessun finanziatore presente"
    },
    "sections": {
      "name": "Nome",
      "repository-and-documentation": "Repository & Documentazione",
      "software-details": "Dettagli Software",
      "legal-and-reuse": "Legal & Riuso",
      "description-and-features": "Descrizione & Funzionalità",
      "logo-and-screenshots": "Logo & Schermate",
      "purpose-and-audience": "Scopo & Audience",
      "maintenance": "Manutenzione"
    }
  },
  "validation": {
    "inprogress": "Validazione in corso"
  },
  "countrySpecificSection": {
    "italy": "Italia"
  },
  "publiccodeyml": {
    "description": {
      "title": "Descrizione e funzionalità",
      "localisedName": {
        "label": "Nome Localizzato",
        "description": "Il nome del software in una lingua specifica. È il nome con il quale la maggioranza delle persone normalmente si riferisce al software. Nel caso in cui il software abbia sia un nome “interno” che uno commerciale, usa quello commerciale."
      },
      "genericName": {
        "label": "Nome Generico",
        "description": "Il “Nome generico”, della categoria alla quale il software appartiene. Per esempio “Editor di Testi”, “Word Processor”, “Web Browser”, “Chat” e così via. Il nome generico può avere una lunghezza fino a 35 caratteri."
      },
      "shortDescription": {
        "label": "Descrizione Breve",
        "description": "La breve descrizione del software. Dovrebbe essere una singola linea contenente una singola frase."
      },
      "longDescription": {
        "label": "Descrizione Estesa",
        "description": "La descrizione lunga che fornisce una panoramica per chi userà il software (e non per chi sviluppa). Può contenere del Markdown base: *italic*, **bold**, elenchi puntati e [link](#)."
      },
      "documentation": {
        "label": "Documentazione",
        "description": "L’URL alla documentazione lato utente (non lato sviluppatore) navigabile utilizzando un comune browser web."
      },
      "apiDocumentation": {
        "label": "Documentazione API",
        "description": "L‘URL alla documentazione delle API del software navigabile utilizzando un comune web browser (e.g. Swagger)."
      },
      "features": {
        "label": "Funzionalità",
        "description": "La lista di feature del software, che descriva le funzionalità lato utente offerte dallo stesso. Il numero di feature suggerito da elencare è tra 5 e 20, a seconda della dimensione del software e della sua complessità.",
        "value": {
          "label": "Funzionalità",
          "description": ""
        }
      },
      "awards": {
        "label": "Premi",
        "description": "Una lista di premi assegnati al software."
      },
      "screenshots": {
        "label": "Schermate",
        "description": "Una o più schermate per dare una panoramica dell’aspetto del software e del suo funzionamento. Può essere il percorso relativo al file a partire dalla radice del repository, oppure un URL assoluto. In entrambi i casi, il file deve risiedere all’interno del medesimo repository che contiene il publiccode.yml."
      },
      "videos": {
        "label": "Video",
        "description": "Uno o più URL di video che mostrano il funzionamento del software per dare una rapida panoramica sull’aspetto e le funzionalità del software. I video devono essere ospitati su una piattaforma di video sharing che supporti lo standard oEmbed; le opzioni più popolari sono YouTube e Vimeo. Dal momento che costituisce parte integrante della documentazione, è opportuno che il video sia pubblicato con una licenza aperta."
      }
    },
    "legal": {
      "license": {
        "label": "Licenza",
        "description": "La licenza con cui il software è distribuito."
      },
      "mainCopyrightOwner": {
        "label": "Principale proprietario del copyright",
        "description": "L’entità che possiede il copyright sulla maggior parte del codice presente nel repository. Normalmente, questa è la linea che viene riportata con il simbolo di copyright all’inizio della maggior parte dei file nel repository. È possibile elencare diversi proprietari se necessario, usando una frase in inglese. È anche possibile riferirsi ad una community o ad un gruppo di persone come ad esempio “Linus Torvalds and all Linux contributors”."
      },
      "repoOwner": {
        "label": "Proprietario del repository",
        "description": "L’entità che possiede il repository; questa può essere o non essere la stessa che possiede il copyright del codice stesso. Ad esempio, nel caso di un fork del software originale, il Proprietario del repository è probabilmente diverso dal principale proprietario del copyright."
      },
      "authorsFile": {
        "label": "File Autori",
        "description": "Qualche software open-source adotta una convenzione che identifica il detentore del copyright attraverso un file elencante tutte le entità che possiedono il copyright. Questo è comune nei progetti fortemente sostenuti dalla community ove esistono diversi contributori esterni e non c’è un chiaro singolo detentore del copyright. In questi casi, si può usare questo campo per riferirsi al suddetto file degli autori, usando un percorso relativo alla radice del repository."
      }
    },
    "intendedAudience": {
      "scope": {
        "label": "Scopo",
        "description": "Una lista di scopi che rappresentano il campo di applicazione del software."
      },
      "countries": {
        "label": "Paesi",
        "description": "Indica in modo esplicito alcuni Paesi tra il pubblico previsto, come la conformità con processi specifici, tecnologie o leggi. Tutti i paesi sono specificati utilizzando codici paese ISO 3166-1 alpha-2 a due lettere in maiuscolo."
      },
      "unsupportedCountries": {
        "label": "Paesi non supportati",
        "description": "Indica esplicitamente i Paesi NON supportati. Questa situazione potrebbe verificarsi nel momento in cui esista un conflitto tra la modalità di funzionamento del software ed una legge specifica, un processo o una tecnologia. Tutti i paesi sono specificati utilizzando codici paese ISO 3166-1 alpha-2 a due lettere in maiuscolo."
      }
    },
    "localisation": {
      "localisationReady": {
        "label": "Supporto alla Localizzazione",
        "description": "Il software ha l’infrastruttura o è stato progettato per essere multi-lingua. Questo campo non pregiudica l’esistenza di una traduzione in altre lingue ma si riferisce esclusivamente all’aspetto tecnologico."
      },
      "availableLanguages": {
        "label": "Lingue Disponibili",
        "description": "La lista di lingue in cui è disponibile il software."
      }
    },
    "it": {
      "countryExtensionVersion": {
        "label": "Versione Sezione Nazionale",
        "description": "Versione Sezione Nazionale"
      },
      "riuso": {
        "label": "Riuso",
        "codiceIPA": {
          "label": "Codice iPA dell'ente (obbligatorio per Pubbliche Amministrazioni)",
          "description": "Codice dell'ente all'interno dell'Indice delle Pubbliche Amministrazioni (codice iPA, https://indicepa.gov.it/)."
        }
      },
      "piattaforme": {
        "label": "Piattaforme",
        "spid": {
          "label": "SPID",
          "description": "Il software si interfaccia con SPID - il Sistema Pubblico di Identità Digitale."
        },
        "cie": {
          "label": "CIE",
          "description": "Il software si interfaccia con la Carta di Identità Elettronica."
        },
        "anpr": {
          "label": "ANPR",
          "description": "Il software si interfaccia con ANPR, l’Anagrafe Nazionale."
        },
        "pagopa": {
          "label": "pagoPA",
          "description": "Il software si interfaccia con pagoPA."
        },
        "io": {
          "label": "IO",
          "description": "Il software si interfaccia con IO - l’app dei servizi pubblici."
        }
      },
      "conforme": {
        "label": "Conforme",
        "lineeGuidaDesign": {
          "label": "Linee guida design",
          "description": "Il software è conforme alle linee guida di design."
        },
        "modelloInteroperabilita": {
          "label": "Interoperabile",
          "description": "Il software è conforme alle linee guida sull’interoperabilità. Riferimento normativo: Art. 73 del CAD."
        },
        "misureMinimeSicurezza": {
          "label": "Misure minime sicurezza",
          "description": "Il software è conforme alle Misure minime di sicurezza ICT per le Pubbliche amministrazioni."
        },
        "gdpr": {
          "label": "GDPR",
          "description": "Il software rispetta il GDPR."
        }
      }
    },
    "maintenance": {
      "type": {
        "label": "Tipo Manutenzione",
        "description": "Descrive come il software è attualmente manutenuto. I possibili valori sono: internal - significa che il software è manutenuto internamente dal proprietario del repository; contract - significa che c’è un contratto commerciale che lega un’entità alla manutenzione del software; community - significa che il software è attualmente manutenuto da una o più persone che offrono il loro tempo al progetto; none - significa che il software non è al momento manutenuto."
      },
      "contacts": {
        "label": "Contatti",
        "description": "Uno o più contatti di chi sta mantenendo il software. Descrive le persone tecniche che attualmente sono responsabili della manutenzione del software. Tutti i contatti devono essere di una persona fisica, non un’azienda o un’organizzazione. Se un contatto funge da rappresentante di un’istituzione, questo rapporto deve essere esplicitato attraverso il campo Affiliazione. Nel caso di un accordo commerciale (o una catena di tali accordi), specificare le entità finali che sono effettivamente contrattate per fornire la manutenzione. Non specificare il proprietario del software a meno che sia tecnicamente coinvolto anche nella manutenzione del prodotto",
        "name": {
          "description": "Obbligatorio - il nome completo di uno dei contatti tecnici. Deve essere una persona reale; NON popolare questa campo con informazioni di contatto generiche, dipartimenti dell’azienda, associazioni, etc.",
          "label": "Nome"
        },
        "phone": {
          "description": "Numero telefonico (con prefisso internazionale).",
          "label": "Telefono"
        },
        "email": {
          "description": "L’indirizzo email del contatto tecnico. NON compilare questo campo con mailing-list o punti di contatto generico tipo “info@acme.inc”.",
          "label": "Email"
        },
        "affiliation": {
          "description": "Informazioni esplicite sui contatti tecnici. Nel caso esistano diversi maintainer, questo valore può essere usato per creare relazioni tra diversi contatti tecnici e entità di manutenzione. Ad esempio, può contenere il nome di un’azienda, il nome di un’associazione, etc",
          "label": "Affiliazione"
        }
      },
      "contractors": {
        "label": "Contratto di Manutenzione",
        "description": "L’entità o le entità, se ce ne sono, che attualmente hanno un contratto di manutenzione del software. Queste possono essere aziende, organizzazioni o altri nomi collettivi.",
        "name": {
          "label": "Nome",
          "description": "Obbligatoria - Il nome del contractor, sia esso un’azienda o una persona fisica."
        },
        "until": {
          "label": "Scadenza",
          "description": "La data di fine della manutenzione. In caso di manutenzione comunitaria, il valore non dovrebbe essere più di 2 anni nel futuro e quindi dovrà essere aggiornato regolarmente man mano che la comunità continua a lavorare sul progetto."
        },
        "email": {
          "description": "L’indirizzo email del contatto tecnico. NON compilare questo campo con mailing-list o punti di contatto generico tipo “info@acme.inc”.",
          "label": "Email"
        },
        "website": {
          "label": "Website",
          "description": "L’indirizzo del sito del maintainer. Può puntare al principale sito istituzionale, o ad una pagina o sito più specifica."
        }
      }
    },
    "dependsOn": {
      "label": "Dipendenze",
      "description": "Panoramica delle dipendenze a livello di sistema necessarie per installare ed utilizzare il software. Nota bene: non elencare le dipendenze a livello di codice sorgente (ad es., librerie software usate), e focalizza solo su dipendenze di sistema e/o a runtime che devono essere installate e manutenute separatamente. Ad esempio, un database è un buon esempio di questo tipo di dipendenza.",
      "type": {
        "label": "Tipo"
      },
      "name": {
        "label": "Nome",
        "description": "Obbligatorio - Il nome della dipendenza (e.g. MySQL, NFC Reader)."
      },
      "versionMin": {
        "label": "Versione Minima",
        "description": "la prima versione compatibile;"
      },
      "versionMax": {
        "label": "Version Massima",
        "description": "l’ultima versione compatibile;"
      },
      "version": {
        "label": "Versione Esatta",
        "description": "l’unica versione major con la quale il software è compatibile. Si assume la compatibilità con tutte le patch e i bugfix che saranno applicati successivamente a questa versione;"
      },
      "optional": {
        "label": "Opzionale",
        "description": "se la dipendenza è opzionale o obbligatoria."
      }
    },
    "publiccodeYmlVersion": {
      "label": "publiccodeYmlVersion",
      "description": "Campo nascosto per l'ultima versione di publiccode"
    },
    "name": {
      "label": "Nome del software",
      "description": "Il nome del software con il quale la maggior parte delle persone si riferisce a esso. Nel caso in cui il software abbia sia un nome in “codice” interno che uno commerciale, usa il nome commerciale."
    },
    "releaseDate": {
      "label": "Data di rilascio",
      "description": "La data di ultimo rilascio del software. Obbligatoria se il software è stato rilasciato almeno una volta e dunque esiste un numero di versione."
    },
    "url": {
      "label": "URL Repository",
      "description": "L’URL che punta al repository di codice sorgente (git, svn, …) nel quale il software è pubblicato. Se il repository è disponibile sotto diversi protocolli, preferire la versione HTTPS."
    },
    "applicationSuite": {
      "label": "Application Suite",
      "description": "Il nome della “suite” alla quale il software appartiene."
    },
    "landingURL": {
      "label": "URL Landing Page",
      "description": "L’URL che punta a una pagina di presentazione leggibile da un utente."
    },
    "isBasedOn": {
      "label": "Variante o fork di",
      "description": "Nel caso in cui questo software sia una variante o un fork di un altro software, che opzionalmente può contenere un file publiccode.yml, questo valore conterrà l’URL di uno o più progetti originali."
    },
    "softwareVersion": {
      "label": "Versione Software",
      "description": "Il numero dell’ultima versione stabile del software. Può essere omesso nel caso in cui il software sia in una fase iniziale di sviluppo e non sia stato ancora rilasciato."
    },
    "logo": {
      "label": "Logo",
      "description": "Il logo del software. Il valore può essere il percorso relativo al file a partire dalla radice del repository, oppure un URL assoluto che punta al logo in versione raw. In entrambi i casi, il file deve risiedere all’interno del medesimo repository che contiene il publiccode.yml. Il logo dovrebbe essere in formato vettoriale; i formati raster sono solo accettabili come fallback. In questo caso, dovrebbero essere PNG trasparenti, con una larghezza minima di 1000px."
    },
    "monochromeLogo": {
      "label": "Logo Monocromo",
      "description": "Il logo monocromatico (nero) del software. Il valore può essere il percorso relativo al file a partire dalla root del repository, oppure un URL assoluto che punta al logo in versione raw. In entrambi i casi, il file deve risiedere all’interno del medesimo repository che contiene il publiccode.yml. Il logo dovrebbe essere in formato vettoriale; i formati raster sono solo accettabili come fallback. In questo caso, dovrebbero essere PNG trasparenti, con una larghezza minima di 1000px."
    },
    "developmentStatus": {
      "label": "Stato Sviluppo",
      "description": "Le chiavi sono: concept - Il software è solo un “concept”. Non è stato sviluppato codice e il repository potrebbe semplicemente essere un placeholder. development - Qualche sforzo è stato fatto in direzione dello sviluppo del software ma il codice non è pronto per l’utenza finale, nemmeno in una versione preliminare (beta o alpha) per essere testato dall’utenza. beta - Il software è in fase di testing (alpha o beta). In questo stage, il software potrebbe aver o non aver ancora avuto una release pubblica preliminare. stable - Il software ha già avuto una prima release pubblica ed è pronto per essere usato in un contesto di produzione. obsolete - Il software non è più manutenuto o aggiornato. Tutto il codice sorgente è archiviato e tenuto per ragioni di storico."
    },
    "softwareType": {
      "label": "Tipo Software",
      "description": "Valori possibili: standalone, addon, library, configurationFiles"
    },
    "roadmap": {
      "label": "Roadmap",
      "description": "Un link a una roadmap pubblica del software."
    },
    "platforms": {
      "label": "Piattaforme",
      "description": "La piattaforma su cui funziona il software è disponibile. È pensata per descrivere le piattaforme che l’utente userà per accedere ed utilizzare il software, piuttosto che la piattaforma sul quale il software gira. Se possibile, usare i valori predefiniti. Se il software gira su una piattaforma per la quale un valore predefinito non è disponibile, un diverso valore può essere usato."
    },
    "categories": {
      "label": "Categorie",
      "description": "Una lista di categorie di cui questo software fa parte."
    },
    "organisation": {
      "uri": {
        "label": "URI organizzazione",
        "description": "Un identificatore univoco per l'organizzazione che sviluppa, mantiene o possiede il software. Può essere un URI standard o un URN (ad esempio, urn:x-italian-pa:[codiceIPA] per le amministrazioni pubbliche italiane)."
      }
    },
    "fundedBy": {
      "label": "Finanziato da",
      "name": { "label": "Nome organizzazione" },
      "uri": { "label": "URI organizzazione" }
    },
    "usedBy": {
      "label": "Usato Da",
      "description": "Una lista di nome di prominenti Pubbliche Amministrazioni (che serviranno come “testimonial”) che il maintainer riconosce come utilizzatori attuali di questo software.I parser sono incoraggiati ad accrescere questa lista anche con altre informazioni che riescono ad ottenere in modo indipendente; ad esempio, il fork di un software, di proprietà di un’amministrazione, può essere usato come un segnale di uso del software."
    },
    "inputTypes": {
      "label": "Input Types",
      "description": "Una lista di Media Types (MIME Types), come specificato dal RFC 6838, che possono essere gestiti in input dall’applicazione. Nel caso in cui il software non supporti alcun input, è possibile saltare questo campo o usare application/x.empty."
    },
    "outputTypes": {
      "label": "Output Types",
      "description": "Una lista di Media Types (MIME Types), come specificato dal RFC 6838, che possono essere gestiti in output dall’applicazione. Nel caso in cui il software non supporti alcun output, è possibile saltare questo campo o usare application/x.empty."
    }
  }
}
